Dlubal.RFEM5.IGuideObjects
Interface for working with guide objects

Dlubal.RFEM5.IGuideObjects.PrepareModification
Prepares application for data modification.

Dlubal.RFEM5.IGuideObjects.FinishModification
Finishes data modification and updates the model.

Dlubal.RFEM5.IGuideObjects.CancelModification
Cancels current data modification.

Dlubal.RFEM5.IGuideObjects.Clean
Cleans guide objects.

Dlubal.RFEM5.IGuideObjects.DeleteObjects(System.UInt32,System.String)
Deletes specified objects.
Type: Type of guide objects.
List: List of object numbers to delete. E.g.: "1,2,3"; "1-5"; "1-3,5"; "all"

Dlubal.RFEM5.IGuideObjects.SetObjectID(System.UInt32,System.Int32,System.UInt32,System.String)
Sets ID of the object.
Type: Type of guide object.
No: Number or index of the object.
At: Specifies the type of access.
ID: New ID to be set.

Dlubal.RFEM5.IGuideObjects.GetDimensionCount
Gets count of dimensions.
Returns: Count of dimensions in the model.

Dlubal.RFEM5.IGuideObjects.GetDimension(System.Int32,System.UInt32)
Gets interface for working with dimension.
Returns: Dimension interface.
No: Number or index of the dimension you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IGuideObjects.GetDimensions
Gets array of dimensions.
Returns: Array of dimensions.

Dlubal.RFEM5.IGuideObjects.GetLinearDimensionCount
Gets count of linear dimensions.
Returns: Count of linear dimensions in the model.

Dlubal.RFEM5.IGuideObjects.GetLinearDimension(System.Int32,System.UInt32)
Gets interface for working with linear dimension.
Returns: Linear dimension interface.
No: Number or index of the linear dimension you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IGuideObjects.SetLinearDimension(System.UInt32@)
Sets linear dimension and returns it's interface.
Returns: Linear dimension interface
Dimension: Linear dimension parameters

Dlubal.RFEM5.IGuideObjects.GetLinearDimensions
Gets array of linear dimensions.
Returns: Array of linear dimensions.

Dlubal.RFEM5.IGuideObjects.SetLinearDimensions(System.UInt32@)
Sets array of linear dimensions.
Dimensions: Array of linear dimensions to be set.

Dlubal.RFEM5.IGuideObjects.GetArcLengthDimensionCount
Gets count of arc length dimensions.
Returns: Count of arc length dimensions in the model.

Dlubal.RFEM5.IGuideObjects.GetArcLengthDimension(System.Int32,System.UInt32)
Gets interface for working with arc length dimension.
Returns: Arc length dimension interface.
No: Number or index of the arc length dimension you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IGuideObjects.SetArcLengthDimension(System.UInt32@)
Sets arc length dimension and returns it's interface.
Returns: Arc length dimension interface
Dimension: Arc length dimension parameters

Dlubal.RFEM5.IGuideObjects.GetArcLengthDimensions
Gets array of arc length dimensions.
Returns: Array of arc length dimensions.

Dlubal.RFEM5.IGuideObjects.SetArcLengthDimensions(System.UInt32@)
Sets array of arc length dimensions.
Dimensions: Array of arc length dimensions to be set.

Dlubal.RFEM5.IGuideObjects.GetAngularDimensionCount
Gets count of angular dimensions.
Returns: Count of angular dimensions in the model.

Dlubal.RFEM5.IGuideObjects.GetAngularDimension(System.Int32,System.UInt32)
Gets interface for working with angular dimension.
Returns: Angular dimension interface.
No: Number or index of the angular dimension you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IGuideObjects.SetAngularDimension(System.UInt32@)
Sets angular dimension and returns it's interface.
Returns: Angular dimension interface
Dimension: Angular dimension parameters

Dlubal.RFEM5.IGuideObjects.GetAngularDimensions
Gets array of angular dimensions.
Returns: Array of angular dimensions.

Dlubal.RFEM5.IGuideObjects.SetAngularDimensions(System.UInt32@)
Sets array of angular dimensions.
Dimensions: Array of angular dimensions to be set.

Dlubal.RFEM5.IGuideObjects.GetRadialDimensionCount
Gets count of radial dimensions.
Returns: Count of radial dimensions in the model.

Dlubal.RFEM5.IGuideObjects.GetRadialDimension(System.Int32,System.UInt32)
Gets interface for working with radial dimension.
Returns: Radial dimension interface.
No: Number or index of the radial dimension you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IGuideObjects.SetRadialDimension(System.UInt32@)
Sets radial dimension and returns it's interface.
Returns: Radial dimension interface
Dimension: Radial dimension parameters

Dlubal.RFEM5.IGuideObjects.GetRadialDimensions
Gets array of radial dimensions.
Returns: Array of radial dimensions.

Dlubal.RFEM5.IGuideObjects.SetRadialDimensions(System.UInt32@)
Sets array of radial dimensions.
Dimensions: Array of radial dimensions to be set.

Dlubal.RFEM5.IGuideObjects.GetSlopeDimensionCount
Gets count of slope dimensions.
Returns: Count of slope dimensions in the model.

Dlubal.RFEM5.IGuideObjects.GetSlopeDimension(System.Int32,System.UInt32)
Gets interface for working with slope dimension.
Returns: Slope dimension interface.
No: Number or index of the slope dimension you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IGuideObjects.SetSlopeDimension(System.UInt32@)
Sets slope dimension and returns it's interface.
Returns: Slope dimension interface
Dimension: Slope dimension parameters

Dlubal.RFEM5.IGuideObjects.GetSlopeDimensions
Gets array of slope dimensions.
Returns: Array of slope dimensions.

Dlubal.RFEM5.IGuideObjects.SetSlopeDimensions(System.UInt32@)
Sets array of slope dimensions.
Dimensions: Array of slope dimensions to be set.

Dlubal.RFEM5.IGuideObjects.GetHeightDimensionCount
Gets count of height dimensions.
Returns: Count of height dimensions in the model.

Dlubal.RFEM5.IGuideObjects.GetHeightDimension(System.Int32,System.UInt32)
Gets interface for working with height dimension.
Returns: Height dimension interface.
No: Number or index of the height dimension you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IGuideObjects.SetHeightDimension(System.UInt32@)
Sets height dimension and returns it's interface.
Returns: Height dimension interface
Dimension: Height dimension parameters

Dlubal.RFEM5.IGuideObjects.GetHeightDimensions
Gets array of height dimensions.
Returns: Array of height dimensions.

Dlubal.RFEM5.IGuideObjects.SetHeightDimensions(System.UInt32@)
Sets array of height dimensions.
Dimensions: Array of height dimensions to be set.

Dlubal.RFEM5.IGuideObjects.GetDimensionOptions(System.UInt32@)
Gets dimension options.
Options: Dimension options

Dlubal.RFEM5.IGuideObjects.SetDimensionOptions
Sets dimension options.
Returns: Dimension options

Dlubal.RFEM5.IGuideObjects.GetCommentCount
Gets count of comments.
Returns: Count of comments in the model.

Dlubal.RFEM5.IGuideObjects.GetComment(System.Int32,System.UInt32)
Gets interface to Comment.
Returns: Comment interface.
No: Number or index of the comment you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IGuideObjects.SetComment(System.UInt32@)
Sets comment and returns it's interface.
Returns: Comment interface
Comment: Comment parameters

Dlubal.RFEM5.IGuideObjects.GetComments
Gets array of comments.
Returns: Array of comments.

Dlubal.RFEM5.IGuideObjects.SetComments(System.UInt32@)
Sets array of comments.
Comments: Array of comments to be set.

Dlubal.RFEM5.IGuideObjects.GetCoordinateSystemCount
Gets count of user-defined coordinate systems.
Returns: Count of user-defined coordinate system in the model.

Dlubal.RFEM5.IGuideObjects.GetCoordinateSystem(System.Int32,System.UInt32)
Gets interface for working with user-defined coordinate system.
Returns: UserCoordinate system interface.
No: Number or index of the user-defined coordinate system you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IGuideObjects.SetCoordinateSystem(System.UInt32@)
Sets user-defined coordinate system and returns it's interface.
Returns: User-defined coordinate system interface
UserCS: User-defined coordinate system parameters

Dlubal.RFEM5.IGuideObjects.GetCoordinateSystems
Gets array of user-defined coordinate systems.
Returns: Array of user-defined coordinate systems.

Dlubal.RFEM5.IGuideObjects.SetCoordinateSystems(System.UInt32@)
Sets array of user-defined coordinate systems.
UserCSs: Array of user-defined coordinate systems to be set.

Dlubal.RFEM5.IGuideObjects.GetActiveCoordinateSystem
Gets active coordinate system.
Returns: Number of active coordinate system. If the value is zero then the global coordinate system is active.

Dlubal.RFEM5.IGuideObjects.SetActiveCoordinateSystem(System.Int32,System.UInt32)
Sets active coordinate system.
No: Number or index of the user-defined coordinate system you want to activate. If No is set to zero and At is set to AtNo then the global coordinate system will be activated.
At: Specifies the type of access.

Dlubal.RFEM5.IGuideObjects.GetGuidelineCount
Gets count of guideline.
Returns: Count of guidelines in the model.

Dlubal.RFEM5.IGuideObjects.GetGuideline(System.Int32,System.UInt32)
Gets interface for working with guideline.
Returns: Guideline interface.
No: Number or index of the guideline you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.IGuideObjects.SetGuideline(System.UInt32@)
Sets guideline and returns it's interface.
Returns: Guideline interface
Guideline: Guideline parameters

Dlubal.RFEM5.IGuideObjects.GetGuidelines
Gets array of guidelines.
Returns: Array of guidelines.

Dlubal.RFEM5.IGuideObjects.SetGuidelines(System.UInt32@)
Sets array of guidelines.
Guidelines: Array of guidelines to be set.